config/emacs.d/general.org
#+title: Emacs other config
#+author: Ulisses Silva
#+description: "Minha outra configuração pessoal"

* Índice :toc_2:
  - [[#programas-para-inciarem-primeiro][Programas para inciarem primeiro]]
  - [[#company][Company]]
  - [[#dashboard][Dashboard]]
  - [[#flycheck][Flycheck]]
  - [[#ivy-counsel][Ivy (Counsel)]]
  - [[#marginalia][Marginalia]]
  - [[#vertico][Vertico]]
  - [[#ordeless][Ordeless]]
  - [[#consult][Consult]]
  - [[#configurações-do-emacs][Configurações do emacs]]
  - [[#org-mode][Org mode]]
  - [[#tema][Tema]]
  - [[#disable-eletric-ident][Disable eletric ident]]
  - [[#expansão-de-tags-no-org-mode][Expansão de tags no org mode]]
  - [[#função-pra-recarregar-a-configuração-emacs][Função pra recarregar a configuração emacs]]
  - [[#sudo-edit][sudo-edit]]
  - [[#raibow-mode][Raibow Mode]]
  - [[#eshell][Eshell]]
  - [[#vterm][Vterm]]
  - [[#doom-modeline][Doom-modeline]]
  - [[#projectile][Projectile]]
  - [[#languages][Languages]]
  - [[#neotree][Neotree]]

** Programas para inciarem primeiro

*** Carrega os arquivos da pasta scripts

#+begin_src emacs-lisp

(add-to-list 'load-path "~/.emacs.d/scripts")

(require 'elpaca-setup)
(require 'buffer-move)
(require 'app-launchers)

#+end_src

*** All the icons

#+begin_src emacs-lisp

  (use-package all-the-icons
  :ensure
  t
  :if (display-graphic-p))

(use-package all-the-icons-dired
  :hook
  (dired-mode . (lambda () (all-the-icons-dired-mode t))))

#+end_src

*** Fonts

#+begin_src emacs-lisp

(set-face-attribute 'default nil
  :font "JetBrainsMono Nerd Font Mono"
  :height 120
  :weight 'medium)
(set-face-attribute 'variable-pitch nil
  :font "JetBrainsMono Nerd Font Mono"
  :height 120
  :weight 'medium)
(set-face-attribute 'fixed-pitch nil
  :font "JetBrainsMono Nerd Font Mono"
  :height 120
  :weight 'medium)
;; Makes commented text and keywords italics.
;; This is working in emacsclient but not emacs.
;; Your font must have an italic face available.
(set-face-attribute 'font-lock-comment-face nil
  :slant 'italic)
(set-face-attribute 'font-lock-keyword-face nil
  :slant 'italic)

;; This sets the default font on all graphical frames created after restarting Emacs.
;; Does the same thing as 'set-face-attribute default' above, but emacsclient fonts
;; are not right unless I also add this method of setting the default font.
(add-to-list 'default-frame-alist
             '(font . "JetBrainsMono Nerd Font Mono-12"))

;; Uncomment the following line if line spacing needs adjusting.
(setq-default line-spacing 0.12)

#+end_src

*** Diminish

#+begin_src emacs-lisp

(use-package diminish)

#+end_src

*** General emacs pacote

#+begin_src emacs-lisp
  (use-package general
    :ensure
    t
    :config
     (general-create-definer leader-def
       :prefix
       "C-c")

   (leader-def 
;; Atalhos de
     arquivo
    "f"  '(:ignore t :which-key "arquivos") ;; Grupo (requer which-key)
    "ff" 'find-file
    "fs" 'save-buffer
    "fr" 'recentf-open-files

    ;; Atalhos de buffer
    "b"  '(:ignore t :which-key "buffers")
    "bb" 'switch-to-buffer
    "bk" 'kill-current-buffer
    "bn" 'next-buffer
    "bp" 'previous-buffer

    ;; Atalhos de janela
    "w"  '(:ignore t :which-key "janelas")
    "w/" 'split-window-right
    "w-" 'split-window-below
    "wd" 'delete-window
    "wo" 'delete-other-windows

    "et" 'eshell

    "tt" 'neotree-toggle

    "//" '(comment-line :wk "Comment lines")
    )

   (general-define-key 
    "<f8>" 'neotree-toggle
    )
  )

#+end_src

** Company

pacote para autocomplete com <tab>

#+begin_src emacs-lisp

(use-package company
  :defer
  2
  :diminish
  :custom
  (company-begin-commands '(self-insert-command))
  (company-idle-delay .1)
  (company-minimum-prefix-length 2)
  (company-show-numbers t)
  (company-tooltip-align-annotations 't)
  (global-company-mode t))

(use-package company-box
  :after
  company
  :diminish
  :hook (company-mode . company-box-mode))

#+end_src

** Dashboard

#+begin_src emacs-lisp

(use-package dashboard
  :ensure
  t 
  :init
  (setq initial-buffer-choice 'dashboard-open)
  (setq dashboard-set-heading-icons t)
  (setq dashboard-set-file-icons t)
  (setq dashboard-banner-logo-title
        "Emacs Is More Than A Text Editor!")
  (setq dashboard-startup-banner 'logo) ;; use standard emacs logo as banner
  ;;(setq dashboard-startup-banner "/home/dt/.config/emacs/images/emacs-dash.png")  ;; use custom image as banner
  (setq dashboard-center-content nil) ;; set to 't' for centered content
  (setq dashboard-items '((recents . 5)
                          (agenda . 5 )
                          (bookmarks . 3)
                          (projects . 3)
                          (registers . 3)))
  :custom
  (dashboard-modify-heading-icons '((recents . "file-text")
                                    (bookmarks . "book")))
  :config
  (dashboard-setup-startup-hook))

#+end_src

** Flycheck

#+begin_src emacs-lisp

(use-package flycheck
:ensure
t
:defer 1
:diminish
:init (global-flycheck-mode))

#+end_src

** Ivy (Counsel)

- Ivy, mecanismo de autocomplete
- Counsel, coleção de scripts do ivy dos comandos do emacs
- Ivy-rich, adiciona descrições aos buffers do ivy

#+begin_src emacs-lisp
(use-package counsel
  :after
  ivy
  :config (counsel-mode))

(use-package ivy
  :bind
  ;; ivy-resume resumes the last Ivy-based completion.
  (("C-c C-r" . ivy-resume)
   ("C-x B" . ivy-switch-buffer-other-window))
  :custom
  (setq ivy-use-virtual-buffers t)
  (setq ivy-count-format "(%d/%d) ")
  (setq enable-recursive-minibuffers t)
  :config
  (ivy-mode))

(use-package all-the-icons-ivy-rich
  :ensure
  t
  :init (all-the-icons-ivy-rich-mode 1))

(use-package ivy-rich
  :after
  ivy
  :ensure t
  :init (ivy-rich-mode 1) ;; this gets us descriptions in M-x.
  :custom
  (ivy-virtual-abbreviate 'full
   ivy-rich-switch-buffer-align-virtual-buffer t
   ivy-rich-path-style 'abbrev)
  :config
  (ivy-set-display-transformer 'ivy-switch-buffer
                               'ivy-rich-switch-buffer-transformer))


#+end_src
*** aumentar ou diminuir a fonte

#+begin_src emacs-lisp
  (global-set-key (kbd "C-=") 'text-scale-increase)
  (global-set-key (kbd "C--") 'text-scale-decrease)
  (global-set-key (kbd "<C-wheel-up>") 'text-scale-increase)
  (global-set-key (kbd "<C-wheel-down>") 'text-scale-decrease)
#+end_src

** Marginalia

#+begin_example emacs-lisp

;; Enable rich annotations using the Marginalia package
(use-package marginalia
  ;; Bind `marginalia-cycle' locally in the minibuffer.  To make the binding
  ;; available in the *Completions* buffer, add it to the
  ;; `completion-list-mode-map'.
  :bind (:map minibuffer-local-map
         ("M-A" . marginalia-cycle))

  ;; The :init section is always executed.
  :init

  ;; Marginalia must be activated in the :init section of use-package such that
  ;; the mode gets enabled right away. Note that this forces loading the
  ;; package.
  (marginalia-mode))

#+end_example

** Vertico
#+begin_example emacs-lisp

;; Enable Vertico.
(use-package vertico
  :custom
   (vertico-scroll-margin 0) ;; Different scroll margin
   (vertico-count 20) ;; Show more candidates
   (vertico-resize t) ;; Grow and shrink the Vertico minibuffer
   (vertico-cycle t) ;; Enable cycling for `vertico-next/previous'
  :init
  (vertico-mode))

#+end_example

*** Complementos do vertico

#+begin_example emacs-lisp

  ;; Persist history over Emacs restarts. Vertico sorts by history position.
(use-package savehist
  :init
  (savehist-mode))

;; Emacs minibuffer configurations.
(use-package emacs
  :custom
  ;; Enable context menu. `vertico-multiform-mode' adds a menu in the minibuffer
  ;; to switch display modes.
  (context-menu-mode t)
  ;; Support opening new minibuffers from inside existing minibuffers.
  (enable-recursive-minibuffers t)
  ;; Hide commands in M-x which do not work in the current mode.  Vertico
  ;; commands are hidden in normal buffers. This setting is useful beyond
  ;; Vertico.
  (read-extended-command-predicate #'command-completion-default-include-p)
  ;; Do not allow the cursor in the minibuffer prompt
  (minibuffer-prompt-properties
   '(read-only t cursor-intangible t face minibuffer-prompt)))

#+end_example


** Ordeless

#+begin_example emacs-lisp

(use-package orderless
  :ensure t
  :custom
  (completion-styles '(orderless basic))
  (completion-category-overrides '((file (styles partial-completion))))
  (completion-pcm-leading-wildcard t)) ;; Emacs 31: partial-completion behaves like substring

#+end_example


** Consult

#+begin_example emacs-lisp

(use-package consult)

#+end_example

** Configurações do emacs

*** Desabilita os menus
#+begin_src emacs-lisp
  (menu-bar-mode 1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
#+end_src

*** Linha de números

#+begin_src emacs-lisp
  (global-display-line-numbers-mode t)
  (global-visual-line-mode t)
#+end_src

*** Move os arquivos de backup do emacs (os que terminam com "~" ou "#file#") pra uma localização definida

#+begin_src emacs-lisp

(setq backup-directory-alist '((".*" . "~/.Trash")))

#+end_src

*** Altera as tabulações para espaços

#+begin_src emacs-lisp

;; espaços ao invés de tabs
(setq-default indent-tabs-mode nil)

#+end_src

*** Alertas visuais e espaçamento das bordas visuais

#+begin_src emacs-lisp

;; alerta visual
(setq visible-bell t)

;; espaçamento das bordas laterais
(set-fringe-mode 10)

#+end_src

*** Hablita o auto-fechamento dos pares (Ex: [], (), {})

#+begin_src emacs-lisp

;; habilita o fechamento de pares
(electric-pair-mode 1)

#+end_src

*** Habilita para sair do mini-buffer com <esc>

#+begin_src emacs-lisp

;; sai do mini buffer com esc
(global-set-key (kbd "<escape>") 'keyboard-escape-quit)

#+end_src

*** Rolagem suave

#+begin_src emacs-lisp

;; Rolagem mais suave
(setq mouse-wheel-scroll-amount '(5 ((shift) . 1)) ;; 2 linhas por vez
   mouse-wheel-progressive-speed nil ;; Não acelera a rolagem
   mouse-wheel-follow-mouse 't ;; rola a janela do mouse
;; rola 1 linha com teclado
   scroll-step 5)

#+end_src

*** Ajustes para facilitar o emacs

#+begin_src emacs-lisp

;; ajustes para facilitar
(global-unset-key (kbd "C-z")) ;; desabilita o suspend-frame (C-z)
(delete-selection-mode t) ;; o texto digitado substitui a seleção

#+end_src

*** Habilita as quebras de linhas muito longas

#+begin_src emacs-lisp

(global-visual-line-mode 1)

#+end_src

*** Altera o formato do cursor

#+begin_src emacs-lisp

(setq-default cursor-type 'bar)

#+end_src

#+begin_src emacs-lisp

#+end_src

** Org mode

habilta o indice

#+begin_src emacs-lisp
  (use-package toc-org
    :commands
    toc-org-enable
    :init (add-hook 'org-mode-hook 'toc-org-enable))
#+end_src

*** org-bullet

#+begin_src emacs-lisp
  (add-hook 'org-mode-hook 'org-indent-mode)
  (use-package org-bullets)
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
#+end_src

*** which key

#+begin_src emacs-lisp
  (which-key-mode 1)
#+end_src


** Tema

#+begin_src emacs-lisp
  (use-package catppuccin-theme
  :ensure
  t
  :config
   (load-theme 'catppuccin t))
  
#+end_src

*** Transparência

#+begin_src emacs-lisp

(add-to-list 'default-frame-alist '(alpha-background . 90)) ; For all new frames henceforth

#+end_src


** Disable eletric ident
#+begin_src emacs-lisp

(electric-indent-mode -1)
(setq org-edit-src-content-indentation 0)

#+end_src


** Expansão de tags no org mode

| Typing the below + TAB | Expands to ...                          |
|------------------------+-----------------------------------------|
| <a                     | '#+BEGIN_EXPORT ascii' … '#+END_EXPORT  |
| <c                     | '#+BEGIN_CENTER' … '#+END_CENTER'       |
| <C                     | '#+BEGIN_COMMENT' … '#+END_COMMENT'     |
| <e                     | '#+BEGIN_EXAMPLE' … '#+END_EXAMPLE'     |
| <E                     | '#+BEGIN_EXPORT' … '#+END_EXPORT'       |
| <h                     | '#+BEGIN_EXPORT html' … '#+END_EXPORT'  |
| <l                     | '#+BEGIN_EXPORT latex' … '#+END_EXPORT' |
| <q                     | '#+BEGIN_QUOTE' … '#+END_QUOTE'         |
| <s                     | '#+BEGIN_SRC' … '#+END_SRC'             |
| <v                     | '#+BEGIN_VERSE' … '#+END_VERSE'         |

o org-tempo está instalado, só precisa ativar

#+begin_src emacs-lisp

  (require 'org-tempo)

#+end_src

** Função pra recarregar a configuração emacs

#+begin_src emacs-lisp

  (defun reload-init-file ()
  (interactive)
  (load-file user-init-file)
  (load-file user-init-file))

#+end_src


** sudo-edit

#+begin_src emacs-lisp

(use-package sudo-edit
  :config
    (leader-def
      "fu" '(sudo-edit-find-file :wk "Sudo find file")
      "fU" '(sudo-edit :wk "Sudo edit file")))

#+end_src

** Raibow Mode 

#+begin_src emacs-lisp

(use-package rainbow-mode
  :hook 
  ((org-mode prog-mode) . rainbow-mode))

#+end_src


** Eshell

terminal escrito em lisp integrado com o emacs

#+begin_src emacs-lisp

(use-package eshell-syntax-highlighting
  :after
  esh-mode
  :config
  (eshell-syntax-highlighting-global-mode +1))

;; eshell-syntax-highlighting -- adds fish/zsh-like syntax highlighting.
;; eshell-rc-script -- your profile for eshell; like a bashrc for eshell.
;; eshell-aliases-file -- sets an aliases file for the eshell.
  
(setq eshell-rc-script (concat user-emacs-directory "eshell/profile")
      eshell-aliases-file
      (concat user-emacs-directory "eshell/aliases")
      eshell-history-size 5000
      eshell-buffer-maximum-lines 5000
      eshell-hist-ignoredups t
      eshell-scroll-to-bottom-on-input t
      eshell-destroy-buffer-when-process-dies t
      eshell-visual-commands'("bash" "fish" "htop" "ssh" "top" "zsh"))

#+end_src

** Vterm

um terminal mais parecido com os terminais para o emacs

#+begin_src emacs-lisp

(use-package vterm
:config
(setq shell-file-name "/bin/fish"
      vterm-max-scrollback 5000))

#+end_src


*** vterm-toggle

#+begin_src emacs-lisp

(use-package vterm-toggle
  :after
  vterm
  :bind ("<f5>" . vterm-toggle)
  :config
  (setq vterm-toggle-fullscreen-p nil)
  (setq vterm-toggle-scope 'project)
  (add-to-list 'display-buffer-alist
               '((lambda (buffer-or-name _)
                     (let ((buffer (get-buffer buffer-or-name)))
                       (with-current-buffer buffer
                         (or (equal major-mode 'vterm-mode)
                             (string-prefix-p vterm-buffer-name
                                              (buffer-name buffer))))))
                  (display-buffer-reuse-window
                   display-buffer-at-bottom)
                  ;;(display-buffer-reuse-window display-buffer-in-direction)
                  ;;display-buffer-in-direction/direction/dedicated is added in emacs27
                  ;;(direction . bottom)
                  ;;(dedicated . t) ;dedicated is supported in emacs27
                  (reusable-frames . visible)
                  (window-height . 0.3))))

#+end_src

*** exec-path-from-shell

sincroniza as variáveis de ambiente

#+begin_src emacs-lisp

(use-package exec-path-from-shell
  :ensure
  t
  :config
  ;; Garante que o PATH e outras variáveis sejam copiadas do shell do sistema
  (when (memq window-system '(mac ns x))
    (exec-path-from-shell-initialize)))

#+end_src

** Doom-modeline

#+begin_src emacs-lisp

(use-package doom-modeline
  :ensure
  t
  :init (doom-modeline-mode 1))
  ;; :hook (after-init . doom-modeline-mode))

#+end_src



** Projectile

#+begin_src emacs-lisp

(use-package projectile
 :config
 (projectile-mode 1))

#+end_src


** Languages

*** emacs modes

#+begin_src emacs-lisp

(use-package lua-mode)

#+end_src

*** python (elpy)

#+begin_src emacs-lisp

(use-package elpy
:ensure
t
:init
(elpy-enable))

#+end_src

*** Elixir

#+begin_src emacs-lisp

(use-package alchemist
:config
(setq 
   alchemist-mix-command
   "~/.local/share/mise/installs/elixir/1.19.4-otp-28/bin/mix"
   alchemist-execute-command
   "~/.local/share/mise/installs/elixir/1.19.4-otp-28/bin/elixir"
   alchemist-iex-program-name
   "~/.local/share/mise/installs/elixir/1.19.4-otp-28/bin/iex"
  
))

#+end_src

*** Emacs lisp

elisp formatter

#+begin_src emacs-lisp

(use-package elisp-autofmt)

#+end_src

** Neotree

#+begin_src emacs-lisp

(use-package neotree
  :config
  (setq neo-smart-open t
        neo-show-hidden-files t
        neo-window-width 55
        neo-window-fixed-size nil
        inhibit-compacting-font-caches t
        projectile-switch-project-action 'neotree-projectile-action) 
        ;; truncate long file names in neotree
        (add-hook 'neo-after-create-hook
           #'(lambda (_)
               (with-current-buffer (get-buffer neo-buffer-name)
                 (setq truncate-lines t)
                 (setq word-wrap nil)
                 (make-local-variable 'auto-hscroll-mode)
                 (setq auto-hscroll-mode nil)))))

#+end_src








